---
kind: property
id: P:Autodesk.Revit.DB.Segment.MaterialId
source: html/bede9529-90c6-a4ad-0ca6-c74115d80a82.htm
---
# Autodesk.Revit.DB.Segment.MaterialId Property

The ElementId of the MaterialElem.

## Syntax (C#)
```csharp
public ElementId MaterialId { get; }
```